guanx139/nrf52_sa/main.c
#define SEC_PARAM_BOND                  1                                       /**< Perform bonding. */
#define SEC_PARAM_MITM                  0                                       /**< Man In The Middle protection not required. */
#define SEC_PARAM_LESC                  0                                       /**< LE Secure Connections not enabled. */
#define SEC_PARAM_KEYPRESS              0                                       /**< Keypress notifications not enabled. */
#define SEC_PARAM_IO_CAPABILITIES       BLE_GAP_IO_CAPS_NONE                    /**< No I/O capabilities. */
#define SEC_PARAM_OOB                   0                                       /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE          7                                       /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE          16                                      /**< Maximum encryption key size. */

#define DEAD_BEEF                       0xDEADBEEF                              /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */


#define SAS_TIMER_INTERVAL              APP_TIMER_TICKS(1850)                   // 1850 ms intervals
#define POWER_BUTTON_PRESS_TIME         APP_TIMER_TICKS(3000)                   // 3s 
#define LED_OFF_TIME                    APP_TIMER_TICKS(1000)                   // 1s 
#define DEVICE_INACTIVE_TIME          480                                     // 120 second, in the unit of 0.25s
#define POWER_BUTTON                    20                                      /**< Pin number for the reset button for waking up the device from system OFF */
//#define POWER_BUTTON                    28                                      /**< Pin number for the reset button for waking up the device from system OFF, for redBear board, Pin D2 */
#define SIGNAL_LED                      12                                      /**< Pin number for the signaling LED */
//#define SIGNAL_LED                      11                                      /**< Pin number for the signaling LED, redBear Board only */
#define BUTTON_PRESSED                  0
#define BUTTON_RELEASED                 1

//ADC Macro
#define ADC_BUF_SIZE  7                           //ADC buffer size
#define RTC_FREQUENCY 32                          //Determines the RTC frequency and prescaler, f_rtc = 32768Hz / (31 + 1) = 1024Hz
#define RTC_CC_VALUE  8                          //Determines the RTC interrupt frequency and thereby the SAADC sampling frequency, f_adc = f_rtc / RTC_CC = 1024/256 = 4Hz
#define SAADC_CALIBRATION_INTERVAL 5              //Determines how often the SAADC should be calibrated relative to NRF_DRV_SAADC_EVT_DONE event. E.g. value 5 will make the SAADC calibrate every fifth time the NRF_DRV_SAADC_EVT_DONE is received.
#define SAADC_SAMPLES_IN_BUFFER 1                 //Number of SAADC samples in RAM before returning a SAADC event. For low power SAADC set this constant to 1. Otherwise the EasyDMA will be enabled for an extended time which consumes high current.
#define SAADC_OVERSAMPLE NRF_SAADC_OVERSAMPLE_DISABLED  //Oversampling setting for the SAADC. Setting oversample to 4x This will make the SAADC output a single averaged value when the SAMPLE task is triggered 4 times. Enable BURST mode to make the SAADC sample 4 times when triggering SAMPLE task once.
#define SAADC_BURST_MODE 0                        //Set to 1 to enable BURST mode, otherwise set to 0.
#define ADC_BUF_FULL 1
#define ADC_BUF_NOT_FULL 0

//#define UART_PRINTING_ENABLED 1

//ADC Functions
static void saadc_init();
static uint16_t get(nrf_saadc_value_t ary[][SAADC_SAMPLES_IN_BUFFER]);
static void put(uint16_t value, uint16_t ary[]);
const  nrf_drv_rtc_t           rtc = NRF_DRV_RTC_INSTANCE(2); /**< Declaring an instance of nrf_drv_rtc for RTC2. */
static nrf_saadc_value_t       m_buffer_pool[2][SAADC_SAMPLES_IN_BUFFER];
static uint16_t                ADC_BUF[ADC_BUF_SIZE];
static uint16_t ADC_BUF_INDEX           = 0;
static bool buffer_status = 0;
static int counter                      = 0;// for debugging only

//Timer functions
static void timers_init(void);
static void application_timers_start(void);
static void power_button_timer_start(void);
static void signal_led_timer_start(void);
static void sas_char_timer_timeout_handler(void * p_context);
static void power_button_timer_timeout_handler(void* p_context);
static void signal_led_timer_timeout_handler(void * p_contex);


/**@brief Function for setting the radio tx power

 * @detail this will set the radio power for pheripheral mode

 * @param[in] int8_t tx power, supported tx_power values: -40dBm, -20dBm, -16dBm, -12dBm, -8dBm, -4dBm, 0dBm, +3dBm and +4dBm.
 */
static void set_radio_power(int8_t tx_power);

/**@brief Function for checking if the device is active, ie, does it detect breath?

 * @param[in] uint16_t adc_val
 */
static void is_device_active(uint16_t val, uint16_t buffer[ADC_BUF_SIZE]);

static void sleep_mode_enter(void);

       
#ifdef UART_PRINTING_ENABLED
static uint32_t                m_adc_evt_counter = 0;
#endif //UART_PRINTING_ENABLED

static bool                    m_saadc_initialized = false;    

APP_TIMER_DEF(m_sas_char_timer_id);
APP_TIMER_DEF(m_power_button_timer_id);
APP_TIMER_DEF(m_signal_led_timer_id);
NRF_BLE_GATT_DEF(m_gatt);                                                       /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                         /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                             /**< Advertising module instance. */

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;                        /**< Handle of the current connection. */

// STEP 1: Declare a ble_os_t service structure for our application

ble_sas_t m_sas;  //sas structure for the application.
static bool current_state = 0;




// STEP 5: Declare variable holding our service UUID
static ble_uuid_t m_adv_uuids[] = 
{
    {
        BLE_UUID_SAS_SERVICE,
        BLE_UUID_TYPE_VENDOR_BEGIN
    }
};

static void advertising_start(bool erase_bonds);


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

//Timer module
/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    // Initialize timer module.
    ret_code_t err_code;
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_sas_char_timer_id, APP_TIMER_MODE_REPEATED, sas_char_timer_timeout_handler);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_power_button_timer_id, APP_TIMER_MODE_SINGLE_SHOT, power_button_timer_timeout_handler);
    APP_ERROR_CHECK(err_code);
     
    err_code = app_timer_create(&m_signal_led_timer_id, APP_TIMER_MODE_SINGLE_SHOT, signal_led_timer_timeout_handler);
    APP_ERROR_CHECK(err_code);

    // Create timers.

    /* YOUR_JOB: Create any timers to be used by the application.
                 Below is an example of how to create a timer.
                 For every new timer needed, increase the value of the macro APP_TIMER_MAX_TIMERS by
                 one.
       ret_code_t err_code;
       err_code = app_timer_create(&m_app_timer_id, APP_TIMER_MODE_REPEATED, timer_timeout_handler);
       APP_ERROR_CHECK(err_code); */
}


/**@brief Function for starting timers for updating the charteristic value.
 */
static void application_timers_start(void)
{
    ret_code_t err_code;
    err_code = app_timer_start(m_sas_char_timer_id, SAS_TIMER_INTERVAL, NULL);

