guanx139/nrf52_sa/main.c
    if(SAADC_BURST_MODE)
    {
        NRF_SAADC->CH[0].CONFIG |= 0x01000000;                                            //Configure burst mode for channel 0. Burst is useful together with oversampling. When triggering the SAMPLE task in burst mode, the SAADC will sample "Oversample" number of times as fast as it can and then output a single averaged value to the RAM buffer. If burst mode is not enabled, the SAMPLE task needs to be triggered "Oversample" number of times to output a single averaged value to the RAM buffer.		
    }

    err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[0],SAADC_SAMPLES_IN_BUFFER);    //Set SAADC buffer 1. The SAADC will start to write to this buffer
    APP_ERROR_CHECK(err_code);
    
    err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[1],SAADC_SAMPLES_IN_BUFFER);    //Set SAADC buffer 2. The SAADC will write to this buffer when buffer 1 is full. This will give the applicaiton time to process data in buffer 1.
    APP_ERROR_CHECK(err_code);

}

/**@brief Function for getting the value from the adc buffer poolm

 * @param[in] nrf_saadc_value_t ary[][SAADC_SAMPLES_IN_BUFFER]

 * @param[out] uint16_t adc value
 */
static uint16_t get(nrf_saadc_value_t ary[][SAADC_SAMPLES_IN_BUFFER]){
    static uint16_t first_index = 0;
    uint16_t adc_value = (uint16_t)ary[first_index][SAADC_SAMPLES_IN_BUFFER - 1];
    return adc_value;
}

/**@brief Function will put a value into the ADC array

 * @param[in] uint16_t value

 * @param[in] uint16_t ary[], this is the ADC array

 */
static void put(uint16_t value, uint16_t ary[]){
    ary[ADC_BUF_INDEX] = value;
    ADC_BUF_INDEX++;
    if(ADC_BUF_INDEX > ADC_BUF_SIZE - 1 && buffer_status == ADC_BUF_NOT_FULL){
        buffer_status = ADC_BUF_FULL;
        ADC_BUF_INDEX = 0;
    }
}


static void set_radio_power(int8_t tx_power){
    ret_code_t err_code;
    err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_CONN, m_conn_handle, tx_power);
    APP_ERROR_CHECK(err_code);
}

static void is_device_active(uint16_t val, uint16_t buffer[ADC_BUF_SIZE]){
    int difference = 0;
    difference = val - buffer[ADC_BUF_INDEX];
    if(difference >= 100 || difference <= -100){
        counter = 0;
    }
    else{
        counter++;
        if(counter >= DEVICE_INACTIVE_TIME){
            sleep_mode_enter();
        }
    }
}


/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;
    //NRF_POWER->DCDCEN = 1;                           //Enabling the DCDC converter for lower current consumption
    // Initialize.
    log_init();
    timers_init();
    //buttons_leds_init(&erase_bonds);

    lfclk_config();                                  //Configure low frequency 32kHz clock
    rtc_config();                                    //Configure RTC. The RTC will generate periodic interrupts. Requires 32kHz clock to operate.
//
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    gpio_config();

    // Start execution.
    NRF_LOG_INFO("started.");
    application_timers_start();
//    nrf_drv_rtc_enable(&rtc); 
    counter = 0;
    advertising_start(erase_bonds);

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */